src/request-samples/pushApirData.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="http://oneiss.doh.gov.ph/webservice">
  <soapenv:Header/>
  <soapenv:Body>
    <urn:pushApirData>
      <Data>
        <Pat_Facility_No>DOH000000000000877</Pat_Facility_No>
        <reg_no>NM201600100001</reg_no>
        <tempreg_no>TN0000000100001</tempreg_no>
        <sentinel></sentinel>
        <date_report>2016-03-29</date_report>
        <time_report>08:30:00</time_report>
        <Pat_Last_Name>Platon</Pat_Last_Name>
        <Pat_First_Name>Jonathan</Pat_First_Name>
        <Pat_Middle_Name>Elec</Pat_Middle_Name>
        <Pat_Suffix></Pat_Suffix>
        <Pat_Date_of_Birth>1988-10-06</Pat_Date_of_Birth>
        <Age_Years>23</Age_Years>
        <Age_Months>11</Age_Months>
        <Age_Days>5</Age_Days>
        <Pat_Sex>M</Pat_Sex>
        <Pat_Current_Address_StreetName>main street</Pat_Current_Address_StreetName>
        <Pat_Current_Address_Region>04</Pat_Current_Address_Region>
        <Pat_Current_Address_Province>0434</Pat_Current_Address_Province>
        <Pat_Current_Address_City>043411</Pat_Current_Address_City>
        <Pat_Current_Address_Barangay>043411001</Pat_Current_Address_Barangay>
        <telephone_no>86517811</telephone_no>
        <four_ps_member>Y</four_ps_member>
        <inj_date>2016-03-30</inj_date>
        <inj_time>07:38:02</inj_time>
        <plc_pat_str>main street</plc_pat_str>
        <poi_sameadd>Y</poi_sameadd>
        <poi_regcode>04</poi_regcode>
        <poi_provcode>0434</poi_provcode>
        <poi_citycode>043411</poi_citycode>
        <poi_bgycode>043411001</poi_bgycode>
        <place_of_occurence>1</place_of_occurence>
        <place_of_occurence_others></place_of_occurence_others>
        <Encounter_Date>2016-03-30</Encounter_Date>
        <Encounter_Time>07:38:02</Encounter_Time>
        <referral>Y</referral>
        <reffered_from></reffered_from>
        <involve_code>10</involve_code>
        <typeof_injurycode>10</typeof_injurycode>
        <injury_type_others></injury_type_others>
        <mult_inj>N</mult_inj>
        <if_fireworks_related>Y</if_fireworks_related>
        <if_fireworks_related_2>N</if_fireworks_related_2>
        <if_fireworks_related_3>N</if_fireworks_related_3>
        <diagnosis>INGESTION</diagnosis>
        <analoc_eye>Y</analoc_eye>
        <analoc_head>N</analoc_head>
        <analoc_neck>N</analoc_neck>
        <analoc_chest>N</analoc_chest>
        <analoc_back>N</analoc_back>
        <analoc_abdomen>N</analoc_abdomen>
        <analoc_buttocks>N</analoc_buttocks>
        <analoc_hand>N</analoc_hand>
        <analoc_forearmarm>N</analoc_forearmarm>
        <analoc_pelvic>N</analoc_pelvic>
        <analoc_thigh>N</analoc_thigh>
        <analoc_knee>N</analoc_knee>
        <analoc_legs>N</analoc_legs>
        <analoc_foot>N</analoc_foot>
        <firecracker_code>10</firecracker_code>
        <firecracker_others></firecracker_others>
        <firecracker_legality>2</firecracker_legality>
        <liquor>Y</liquor>
        <treatment_code>Y</treatment_code>
        <treatment_code2>Y</treatment_code2>
        <treatment_code3>N</treatment_code3>
        <given_others></given_others>
        <disposition_code>TRASH</disposition_code>
        <transferred_to></transferred_to>
        <transferred_to_sp></transferred_to_sp>
        <outcome_code>1</outcome_code>
        <date_died></date_died>
        <aware>Y</aware>
        <educ_material>1,2</educ_material>
        <fac_regno>DOH000000000000877</fac_regno>
        <Facility_Reg>04</Facility_Reg>
        <Facility_Prov>0434</Facility_Prov>
        <Facility_CityMun>043411</Facility_CityMun>
      </Data>
    </urn:pushApirData>
  </soapenv:Body>
</soapenv:Envelope>
